;Place localized text in this file

; - Class Template -
[MrC_APA_DronePilot X2EncyclopediaTemplate]
ListTitle = "Drone Pilot"
DescriptionTitle = "Drone Pilot"
DescriptionEntry = "The Drone Pilot embraces the most advanced technology, using a high-tech BIT to take the fight to their enemies and support their allies from afar.<br/><br/><font color='#CA7200'>Can use Assault Rifles or SMGs and the BIT.</font>"


[MrC_APA_DronePilot X2SoldierClassTemplate]
DisplayName = "Drone Pilot"
ClassSummary = "The Drone Pilot embraces the most advanced technology, using a high-tech BIT to take the fight to their enemies and support their allies from afar.<br/><br/><font color='#CA7200'>Can use Assault Rifles or SMGs and the BIT.</font>"
+AbilityTreeTitles = "Support"
+AbilityTreeTitles = "Utility"
+AbilityTreeTitles = "Offence"
+AbilityTreeTitles = "XCOM"

+RankIcons[0]="UILibrary_Common.rank_rookie"
+RankIcons[1]="UILibrary_WOTC_APA_Class_Pack.ranks_Squaddie_Level1"
+RankIcons[2]="UILibrary_WOTC_APA_Class_Pack.ranks_Corporal_Level1"
+RankIcons[3]="UILibrary_WOTC_APA_Class_Pack.ranks_Sergeant_Level2"
+RankIcons[4]="UILibrary_WOTC_APA_Class_Pack.ranks_Lieutenant_Level2"
+RankIcons[5]="UILibrary_WOTC_APA_Class_Pack.ranks_Captain_Level2"
+RankIcons[6]="UILibrary_WOTC_APA_Class_Pack.ranks_Major_Level3"
+RankIcons[7]="UILibrary_WOTC_APA_Class_Pack.ranks_Colonel_Level3"

RandomNickNames[0]=Gizmo
RandomNickNames[1]=Maverick
RandomNickNames[2]=Merlin
RandomNickNames[3]=Goose
RandomNickNames[4]=Hurricane
RandomNickNames[5]=Eagle
RandomNickNames[6]=Ace
RandomNickNames[7]=Starbuck
RandomNickNames_Male[0]=Ice Man
RandomNickNames_Male[1]=Howling Mad
RandomNickNames_Male[2]=Hermes

;***************************************
;New Ability Descriptions
;***************************************
; - GTS Unlocks -

[WOTC_APA_DronePilotUnlock1 X2SoldierAbilityUnlockTemplate]
DisplayName = "Drone Pilot: BIT Defender I"
Summary = "All Drone Pilot soldiers' BIT Defender proficiency will now start at level 2, regardless of rank."

[WOTC_APA_DronePilotUnlock2 X2SoldierAbilityUnlockTemplate]
DisplayName = "Drone Pilot: BIT Defender II"
Summary = "All Drone Pilot soldiers' BIT Defender proficiency will now start at level 3, regardless of rank.<br/><br/><font color='#CA7200'>Requires BIT Defender I</font>"

[WOTC_APA_BitDefender X2AbilityTemplate]
LocFriendlyName = "BIT Defender"
LocHelpText = "The Drone Pilot's ability to manipulate the BIT's capabilities improves with experience."
LocLongDescription = "The Drone Pilot's ability to manipulate the BIT''s capabilities improves with experience."
LocPromotionPopupText = "<font color='#CA7200'>LEVEL I</font> (gained at <Ability:RANKNAME1/> rank [1])<br/><Bullet/> Gain Aid Protocol.</br><Bullet/> Aid Protocol Heals and adds +1 Armour to the Target.<br/><Bullet/> If self-targeted Aid Protocol gains Entrenchment Protocol.<br/><Bullet/> Gain +1 Ablative (Shield) HP.<br/><br/><font color='#CA7200'>LEVEL II</font> (gained at <Ability:RANKNAME3/> rank [3])<br/><Bullet/> Gain Threat Assessment - Grants Covering Fire with Aid Protocol.<br/><Bullet/> Gain +1 BIT Heavy Weapon Charge.<br/><Bullet/> Gain +1 Ablative (Shield) HP (2 total).<br/><br/><font color='#CA7200'>LEVEL III</font> (gained at <Ability:RANKNAME6/> rank [6])<br/><Bullet/> Gain Multitasking - Aid Protocol also targets self when applied to others.<br/><Bullet/> Gain +1 BIT Heavy Weapon Charge (2 total).<br/><Bullet/> Gain +1 Ablative (Shield) HP (3 total).<br/>"


[MZGremlinStasis X2AbilityTemplate]
LocFriendlyName="Containment Field"
LocHelpText="Send the <Ability:SecondaryWeaponName/> to place target unit into Stasis for 1 turn."
LocLongDescription="The <Ability:ClassName/> sends the <Ability:SecondaryWeaponName/> to place target unit into Stasis for 1 turn. The unit cannot attack but is immune to all damage."
LocFlyOverText="Containment Field"
LocPromotionPopupText="<Bullet/> Can be used on both allies and enemies.<br/><Bullet/> Has a <Ability:SelfCooldown/> turn cooldown.<br/>"


[MZAcidProtocol X2AbilityTemplate]
LocFriendlyName="Caustic Protocol"
LocLongDescription="Send the <Ability:SecondaryWeaponName/> to an enemy to dump acid on them, dealing guaranteed damage, inflicting acid burning and melting armour."
LocHelpText="Send the <Ability:SecondaryWeaponName/> to an enemy to dump acid on them, dealing guaranteed damage, inflicting acid burning and melting armour. Requires line of sight to the target."
LocFlyOverText="Caustic Protocol"
LocPromotionPopupText="<Bullet/> Has a <Ability:SELFCOOLDOWN/> turn Cooldown."

[MZSabotageProtocol X2AbilityTemplate]
LocFriendlyName="Sabotage Protocol"
LocLongDescription="Send the <Ability:SecondaryWeaponName/> to an enemy to jolt them, disabling weapons and dealing guaranteed damage, which is increased against robotic enemies."
LocHelpText="Send the <Ability:SecondaryWeaponName/> to an enemy to jolt them, disabling weapons and dealing guaranteed damage, which is increased against robotic enemies. Requires line of sight to the target."
LocFlyOverText="Sabotage Protocol"
LocPromotionPopupText="<Bullet/> Sabotage Protocol has <Ability:SELFCHARGES/> charges per mission.<br/><Bullet/> Upgrading your <Ability:SecondaryWeaponName/> will lead to more damage per charge.<br/>"

[MZCombatScanner X2AbilityTemplate]
LocFriendlyName="Combat Scanner"
LocHelpText="The <Ability:SecondaryWeaponName/> scans the designated area, revealing and applying Holo Targeting to all enemies."
LocLongDescription="The <Ability:SecondaryWeaponName/> scans the designated area, revealing and applying Holo Targeting to all enemies."
LocFlyOverText="Combat Scanner"
LocPromotionPopupText="<Bullet/> Can be used to reveal hidden units.<br/><Bullet/> Provides a <Ability:HOLOTARGETAIMBONUS/> Aim bonus when firing at the targeted enemies. <br/><Bullet/> Has a <Ability:SelfCooldown/> turn cooldown.<br/>"

[MZStickyBombProtocol X2AbilityTemplate]
LocFriendlyName="Sticky Bomb Protocol"
LocLongDescription="Send the <Ability:SecondaryWeaponName/> to attach a sticky bomb onto an enemy (does not alert the enemy). The sticky bomb will explode upon that enemy taking damage."
LocHelpText="Send the <Ability:SecondaryWeaponName/> to attach a sticky bomb onto an enemy (does not alert the enemy). The sticky bomb will explode upon that enemy taking damage."
LocFlyOverText="Sticky Bomb Protocol"
LocPromotionPopupText="<Bullet/> Shots against the mined target are guaranteed to hit.<br/><Bullet/> Has <Ability:SelfCharges/> charges."

[MZVoltaicArc X2AbilityTemplate]
LocFriendlyName="Voltaic Arc"
LocHelpText="The <Ability:SecondaryWeaponName/> shocks enemies if they move too close to the <Ability:ClassName/> or if the <Ability:ClassName/> moves close to them. This attack chains to nearby enemies."
LocLongDescription="The <Ability:SecondaryWeaponName/> shocks enemies if they move too close to the <Ability:ClassName/> or if the <Ability:ClassName/> moves close to them. This attack chains to nearby enemies."
LocPromotionPopupText="<Bullet/> Deals electrical damage that pierces armour.<br/><Bullet/> Can only chain to units friendly to the targeted unit.<br/><Bullet/> Deals less damage than Chaining Jolt.<br/>"

[MZNapalmProtocol X2AbilityTemplate]
LocFriendlyName="Napalm Protocol"
LocLongDescription="Send the <Ability:SecondaryWeaponName/> to a location where it offloads a large volume of napalm, damaging and burning all nearby units."
LocHelpText="Send the <Ability:SecondaryWeaponName/> to ignite all targets in a radius. Deals fire damage."
LocFlyOverText="Napalm Protocol"
LocPromotionPopupText="<Bullet/> Napalm Protocol has <Ability:SELFCHARGES/> charge per mission.<br/><Bullet/> Napalm Protocol will deal more damage as you upgrade your <Ability:SecondaryWeaponName/>.<br/>"

[MZBarrierProtocol X2AbilityTemplate]
LocFriendlyName="Barrier Protocol"
LocLongDescription="Send the <Ability:SecondaryWeaponName/> to deploy a barrier on an ally that can absorb damage."
LocHelpText="Send the <Ability:SecondaryWeaponName/> to deploy a barrier on an ally that can absorb damage."
LocFlyOverText="Barrier Protocol
LocPromotionPopupText="<Bullet/> Barrier effectiveness scales with <Ability:SecondaryWeaponName/> tech level.<br/><Bullet/> Does not end the turn if used as the first action.<br/><Bullet/> Does not stack with other major barriers.<br/><Bullet/> Recasting before expiry will refill the amount the barrier can absorb.<br/><Bullet/> Has a <Ability:SelfCooldown/> turn cooldown."
